const {
    writeStripe,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
    printNT,
} = require('./nametables');

const buffer = blankNT();

const lookup = flatLookup(`
0123456789ABCDEF
GHIJKLMNOPQRSTUV
WXYZ-,'╥┌━┐┇╏└╍┘
ghijklmn╔╧╗╣╠╚╤╝
wxyz╭▭╮╢╟╰▱╯├╪┤/
┉=!@[]^Ëq{|}~¹()
¼½¾¿ÀÁÂÃÄÅÆÇÈÉ‟.
ÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛ
ÜÝÞßàáâãäåæçèéêë
ìíîïðñòóôõö÷øùúû
üýþÿЉЊЋЌЍЎЏАБВГД
ЕЖЗИЙКЛМНОПРСТУФ
ХЦЧШЩЪЫЬЭЮЯабвгд
εζηθικλμνξοπρςστ
υφχψωϊϋόύώϏϐϑϒϓϔ
ϕϖϗϘϙ©ϛ┬ϝϞϟϠϡͰͱ_
`);

drawTiles(buffer, lookup, `
ÖÃÓÓÎÕÖÔÑÖÃÓÔßÔßÓãÃÔÏãÌÍÃãÔÑÖÎÖÃ
ÎßãÓãÃÔÏãÎßãÔÕÕÖãÔàÖÞÖÜÝÞÕÖãÔßÔá
ãÎÖãÔàÖÞÖãÃ╔╧╧╧╧╧╧╧╧╧╧╗╔╧╧╧╧╧╧╗ã
ÃÓ╔╧╧╧╧╧╧╗Ó╣_LINES-___╠╣______╠Ã
Óã╣_-TYPE╠Ó╚╤╤╤╤╤╤╤╤╤╤╝╣TOP___╠Ó
ÜÖ╚╤╤╤╤╤╤╝ãghhhhhhhhhhi╣000000╠Ó
ÔÕÕÖÃÌÍÃÔÕÏj__________k╣______╠ã
ÕÖÔÕßÜÝÞÕÖãj__________k╣SCORE_╠Ã
Ï╔╧╧╧╧╧╧╧╧╗j__________k╣000000╠Þ
Ó╣ÅÆÇÈÉ‟.)╠j__________k╣______╠Ã
ã╣________╠j__________k╚╤╤╤╤╤╤╝Ó
Ö╣_wxy____╠j__________kÔÕÕÖÔÕÏÔß
Ö╣_┉=!000_╠j__________kghhhhiãÃÔ
Ö╣_╰▱╯____╠j__________kjNEXTkÎßÔ
Ã╣_{|}000_╠j__________kj____kãÎÖ
Ó╣_╮╢_____╠j__________kj____kÔßÌ
Ó╣_^Ëq000_╠j__________kj____kÎÖÜ
ã╣_¼½_____╠j__________kj____kÓÔÏ
Í╣_¾¿_000_╠j__________klmmmmnãÃÓ
Ý╣_z╭▭____╠j__________k╔╧╧╧╧╧╗Óã
Ö╣_@[]000_╠j__________k╣LEVEL╠ÓÔ
Ö╣_├╪┤____╠j__________k╣_____╠ãÃ
Ã╣_~¹(000_╠j__________k╚╤╤╤╤╤╝Ôá
ß╣________╠j__________kÃÔÑÖÃÎÕÖã
Ï╣_ÀÁÂ000_╠j__________kÐÖãÔáãÃÔÕ
Ó╣________╠j__________kãÔÕÏãÎßÎÖ
ã╚╤╤╤╤╤╤╤╤╝lmmmmmmmmmmnÃÌÍãÃãÔßÃ
ÃÃÔÑÖÎÕÖÃÔÏÔÏÃÎÖÎÕÖÔÕÕÖÓÜÝÔáÃÔÕß
ÓÞÏãÃãÃÎßÃÞÖÓÓÓÃãÃÌÍÎÖÃÜÖÔÏãÓÔÕÕ
ÜÖãÔàÖÓãÔàÖÃãÓãÓÎßÜÝÓÃÞÕÖÃÓÔßÎÖÃ
`);


drawAttrs(buffer, [`
    3333333333333333
    3333333333333333
    3333333333333333
    3333332222233333
    3333332222233333
    3220032222233333
    3220032222233333
    3220032222233333
`, `
    3220032222233333
    3220032222233333
    3220032222233333
    3220032222233333
    3220032222233333
    3333333333333333
    3333333333333333
    0000000000000000
`]);

writeStripe(
    __dirname + '/game_nametable.bin',
    0x2000,
    buffer,
);
