const {
    writeStripe,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
} = require('./nametables');

const buffer = blankNT();

const lookup = flatLookup(`
0123456789ABCDEF
GHIJKLMNOPQRSTUV
WXYZ-,'╥┌━┐┇╏└╍┘
ghijklmn╔╧╗╣╠╚╤╝
wxyz╭▭╮╢╟╰▱╯├╪┤/
┉=!@[]^Ëq{|}~¹()
¼½¾¿ÀÁÂÃÄÅÆÇÈÉ‟.
ÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛ
ÜÝÞßàáâãäåæçèéêë
ìíîïðñòóôõö÷øùúû
üýþÿЉЊЋЌЍЎЏАБВГД
ЕЖЗИЙКЛМНОПРСТУФ
ХЦЧШЩЪЫЬЭЮЯабвгд
εζηθικλμνξοπρςστ
υφχψωϊϋόύώϏϐϑϒϓϔ
ϕϖϗϘϙ©ϛ┬ϝϞϟϠϡͰͱ_
`);

drawTiles(buffer, lookup, `
ÎÞ¾¾¾ÜíÜzß¾Î¼½ÞìßÎìÝßÞ¾Þ¾Î¾ÜÝÝßÎ
ÎÜyÎüíÎ¾ÞÜyÞÌÍÜýÜýÞÜÝíÎÜyÎwßìßÜý
Þ¾ÞüßÞÞüÝßÞ╔╧╧╧╧╧╧╧╧╗ÞüßÞÞÞÜýìß¾
Üxß╔╧╧╧╧╧╧╧╣__-TYPE_╠╧╧╧╧╧╧╧╗Îìý
¾Üí╣_______╚╤╤╤╤╤╤╤╤╝_______╠ÞÞ¾
y¾Î╣________________________╠ÜÝý
ÞÎÞ╣________________________╠ìßÜ
¾üß╣_____CONGRATULATIONS____╠Î¼½
wß¾╣________________________╠ÞÌÍ
ÞÜy╣________________________╠ÜíÜ
¼½Þ╣_______YOU_ARE_A________╠¾üß
ÌÍ¾╣________________________╠üÝß
¼½Î╣_____TETRIS_MASTER._____╠¾¾¾
ÌÍÎ╣________________________╠ÎÎw
ÜíÞ╣________________________╠ÎÎÞ
¾üß╣_PLEASE_ENTER_YOUR_NAME_╠ÞÞ¾
wß¾╣________________________╠ÜíÎ
Þìý╣_┌━━━━━━━━━━━━━━━━━━━━┐_╠¾ÎÎ
ßÞ¾╣_┇____NAME__SCORE__LV_╏_╠ÎÞÞ
ÜÝý╣_├╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┤_╠üßÜ
ÜÝí╣_┇_1__________________╏_╠Üzß
ìßÞ╣_┇____________________╏_╠¾ÞÜ
Î¼½╣_┇_2__________________╏_╠üÝß
ÞÌÍ╣_┇____________________╏_╠¼½Ü
ßìß╣_┇_3__________________╏_╠ÌÍÜ
Üý¾╣_└╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┘_╠¾¼½
ÜÝý╣________________________╠ÎÌÍ
ÝÝß╚╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╝üß¾
¼½¼½ÜÝÝß¾¾¾ÜÝí¾Üzß¾¾ÜÝÝß¾ìß¼½¾ìý
ÌÍÌÍìßÜÝýÎüÝßÞwßÞÜywßÜíÜyÎ¾ÌÍÎÞ¾
`);

drawAttrs(buffer, [`
    2222222222222222
    2222222222222222
    2222222222222222
    2200333333330022
    2200000000000022
    2200000000000022
    2200000000000022
    2200000000000022
`,`
    2200000000000022
    2200000000000022
    2200000000000022
    2200000000000022
    2200000000000022
    2222222222222222
    2222222222222222
    0000000000000000
`]);

writeStripe(
    __dirname + '/enter_high_score_nametable.bin',
    0x2000,
    buffer,
);
