const {
    writeStripe,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
} = require('./nametables');

const lookup = flatLookup(`
0123456789ABCDEF
GHIJKLMNOPQRSTUV
WXYZ-,'╥┌━┐┇╏└╍┘
ghijklmn╔╧╗╣╠╚╤╝
wxyz╭▭╮╢╟╰▱╯├╪┤/
┉=!@[]^Ëq{|}~¹()
¼½¾¿ÀÁÂÃÄÅÆÇÈÉ‟.
ÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛ
ÜÝÞßàáâãäåæçèéêë
ìíîïðñòóôõö÷øùúû
üýþÿЉЊЋЌЍЎЏАБВГД
ЕЖЗИЙКЛМНОПРСТУФ
ХЦЧШЩЪЫЬЭЮЯабвгд
εζηθικλμνξοπρςστ
υφχψωϊϋόύώϏϐϑϒϓϔ
ϕϖϗϘϙ©ϛ┬ϝϞϟϠϡͰͱ_
`);

const buffer = blankNT();

drawTiles(buffer, lookup, `
¼½¼½¾Þ¾ìß¾¾¾ÞÜíÜíÌÍ¾ÞÜÝÝßìß¾¾ÜÝí
ÌÍÌÍÎÜyÎìýÎüÝßüßüßÜxßìÝßÜýìýüÝßÞ
ÜÝÝßüßÞÞÞÜý╔╧╧╧╧╧╧╧╧╗ÞÜÝÝßÞÜÝí¼½
Üí¾╔╧╧╧╧╧╧╧╣_B-TYPE_╠╧╧╧╧╧╧╧╗ÞÌÍ
¾ÎÎ╣_______╚╤╤╤╤╤╤╤╤╝_______╠ìÝß
ÎÞÎ╣________________________╠ÞÜí
üßÞ╣________________________╠¼½Î
ìÝß╣____╭▭▭▭▭▭╮____╭▭▭▭▭▭▭╮_╠ÌÍÞ
ÞÜí╣____╢LEVEL╟____╢HEIGHT╟_╠ÜÝí
¼½Î╣____╰▱▱▱▱▱╯____╰▱▱▱▱▱▱╯_╠¾¾Þ
ÌÍÞ╣__┌━┉━┉━┉━┉━┐__┌━┉━┉━┐__╠Îüí
ÜÝí╣__┇0┇1┇2┇3┇4╏__┇0┇1┇2╏__╠Î¾Þ
¾¾Þ╣__├╍╪╍╪╍╪╍╪╍┤__├╍╪╍╪╍┤__╠ÞÎÜ
Îüí╣__┇5┇6┇7┇8┇9╏__┇3┇4┇5╏__╠¾üß
Î¾Þ╣__└╍=╍=╍=╍=╍┘__└╍=╍=╍┘__╠üÝß
ÞÎÜ╣________________________╠ìÝß
¾üß╣________________________╠ÞÜí
üÝß╣_┌━━━━━━━━━━━━━━━━━━━━┐_╠¼½Î
¾Üí╣_┇____NAME__SCORE__LV_╏_╠ÌÍÞ
y¾Î╣_├╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┤_╠ÜÝí
ÞÎÞ╣_┇_1__________________╏_╠¾¾Þ
Üý¾╣_┇____________________╏_╠Îüí
¼½Î╣_┇_2__________________╏_╠Î¾Þ
ÌÍÎ╣_┇____________________╏_╠ÞÎÜ
¾¾Þ╣_┇_3__________________╏_╠¾üß
ÎwÏ╣_└╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍╍┘_╠üÝß
ÎÞ¾╣________________________╠¾¼½
Þìý╚╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╝ÎÌÍ
¾Þìß¾ÜÝíÜÝÝßìßìß¼½ìÝß¾ÜzßÜíÜíüß¾
ÎÜýÜxß¾ÞÜzßÜý¾Î¾ÌÍÞÜÝý¾Þ¼½üßüßÜx
`);


drawAttrs(buffer, [`
    2222222222222222
    2222222222222222
    2211122222211122
    2211222212222222
    2211222202222222
    2213333333333122
    2213333333333122
    2213333333333122
`,`
    2200000000000022
    2200000000000022
    2200000000000022
    2200000000000022
    2200000000000022
    2222222222222222
    2222222222222222
    0000000000000000
`]);

writeStripe(
    __dirname + '/level_menu_nametable.bin',
    0x2000,
    buffer,
);
