const {
    writeStripe,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
} = require('./nametables');

const lookup = flatLookup(`
0123456789ABCDEF
GHIJKLMNOPQRSTUV
WXYZ-,'╥┌━┐┇╏└╍┘
ghijklmn╔╧╗╣╠╚╤╝
wxyz╭▭╮╢╟╰▱╯├╪┤/
┉=!@[]^Ëq{|}~¹()
¼½¾¿ÀÁÂÃÄÅÆÇÈÉ‟.
ÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛ
ÜÝÞßàáâãäåæçèéêë
ìíîïðñòóôõö÷øùúû
üýþÿЉЊЋЌЍЎЏАБВГД
ЕЖЗИЙКЛМНОПРСТУФ
ХЦЧШЩЪЫЬЭЮЯабвгд
εζηθικλμνξοπρςστ
υφχψωϊϋόύώϏϐϑϒϓϔ
ϕϖϗϘϙ©ϛ┬ϝϞϟϠϡͰͱ_
`);

const buffer = blankNT();

drawTiles(buffer, lookup, `
ßìßìÝß¾ÎÜÝíÞìßÌÍ¾Üxß¼½¾¾Üí¾üßÜÝí
Üý¾ÞÜÝýÞ¼½ÞÜýìÏìýÜÝíÌÍÎwßÎÎÜÝÝßÞ
ÜÝýÜzßìßÌÍÜÝíÎ¾Þ¾¼½Þ¾ÜýÞ¾Þüß_¼½¾
ìÝß¾ÞÜý_ÜÝÝßÞÞÎÜyÌÍìý__Üxß___ÌÍw
Þ¾Üxß________Üý_Þ__Þ__________¾Þ
ìý____________________________üí
Þ__ШЩЪЫЬЪЭЮЯШЩЪЫЬЪСХЦЪ_абУФЕЖ_¾Þ
ìÏ_θικλμκ_ξοθικλμκøεζκ_ύώгд___Î¾
Î__ψ_κ_όκ_ЧϏψ_κ_όκøυφκ_ДͰ~τ___ÎÎ
Þ____κ__κωη___κ__κБϕϖκ_ИͰÈÚ__¾ÞÎ
ìÝß__κ__κϙχ___κ__κØ__κ_Ù¹Ͱÿ__üíÞ
Þ¾___κ__κ_ϗв__κ__κèé_κ_èÉͰÛ___Þ¾
Üzß__κ__κ_ρς__κ__κøù_κ_øùêë___¾w
ßÞ___ϊ__ϊϐϑϒ__ϊ__ϊБВГϊ_БВúû___ÎÞ
¼½____________________________üß
ÌÍ___________________________ÜÝí
ìÏ______________________ï___ÜzßÞ
Î¾___________________]^Ëq{|__ÞÜí
Þüí_________________ÀÁÂÃÄÅÆÇ__¾Î
Ý¾Þ_________________ÐÑÒÓÔÕÖ×_ìýÞ
¾wß____PUSH_START___àáâãäåæç_ÞìÏ
ÎÞ__________________ðñòóôõö÷__ÎÜ
üß__________________ЉЊЋЌЍЎЏА__Þ¾
ÝÝß_________________ЙКЛМНОПР__ìý
½¾____________________________Þ¾
ÍÎ_Üzß___©_1989__ϛ┬ϝϞϟϠ______ÜÝý
íÎ__Þ_____________________¾___¼½
ÞÞ¾___Üí____¾ÜÝí_ìÏìß¾_¾¾ÜyìÝßÌÍ
¼½wß_¾¾üßÜzßÎÜíÞ¾ÎÜýÜyìýüíÞÞ¾ÜíÜ
ÌÍÞÜÝýüÝß¾ÞÜý¾ÎÜyÞìÝßÞÞ¼½Þ¾Üxßüß
`);


drawAttrs(buffer, [`
    2222222222222222
    2222222222222222
    2222222222222222
    2333333333333332
    2111111111111122
    2222222222222222
    2200000000000022
    2000000000000022
`,`
    2000000000333322
    2200000000333322
    2200000000333322
    2200000000333322
    2220311100000022
    2222222222222222
    2222222222222222
    0000000000000000
`]);

writeStripe(
    __dirname + '/title_screen_nametable.bin',
    0x2000,
    buffer,
);
