const {
    writeStripe,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
} = require('./nametables');

const lookup = flatLookup(`
0123456789SCOREL
VHIGTA-UQPNMKJFB
WXYZ◥,'>!♡abcdef
ghijklmnopqrstuv
wxyz#$%&◤()*+/:;
<=?@[]^_ʡ{|}~¹º»
¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊË
ÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛ
ÜÝÞßàáâãäåæçèéêë
ìíîïðñòóôõö÷øùúû
üýþÿЉЊЋЌЍЎЏАБВГД
ЕЖЗИЙКЛМНОПРСТУФ
ХЦЧШЩЪЫЬЭЮЯабвгд
εζηθικλμνξοπρςστ
υφχψωϊϋόύώϏϐϑϒϓϔ
ϕϖϗϘϙϚϛϜϝϞϟϠϡͰͱ.
`);

const buffer = blankNT();

drawTiles(buffer, lookup, `
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ.....SCORE..000000..........ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ..............¼½¾...........ÒÓ
ÒÓ..............ÌÍÎ...........ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ..ÜÞ..................o.....ÒÓ
ÒÓ...................p.rs.u...ÒÓ
ÒÓ..................◤()*+/:;..ÒÓ
ÒÓ.....ГГ...........ʡ{|}~¹º»..ÒÓ
ÒÓ....дσУϔ..ДД......ÄÅÆÇÈÉÊË..ÒÓ
ÒÓвввввУг...ττ......ÔÕÖ×ØÙÚÛ..ÒÓ
ÒÓ.ςбввгσ...ττ......äåæçèéêë..ÒÓ
ÒÓввρςϑϒϒϒϒϒϒϒϓ.....ôõö÷øùúû..ÒÓ
ÒÓâãâãâãâãâãâãâãâãâãâãâãâãâãâãÒÓ
ÒÓòóòóòóòóòóòóòóòóòóòóòóòóòóòóÒÓ
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ

`);


drawAttrs(buffer, [`
    2222222222222222
    2211111111112222
    2211111111110002
    2211111111110002
    2011101111110002
    2011101111110002
    2010002220000002
    2010000011000002
`,`
    2000000000000002
    2012200000003002
    2222222200333002
    2222212200333302
    2222222200000002
    2000000000000002
    2222222222222222
    0000000000000000
`]);

writeStripe(
    __dirname + '/type_a_ending_nametable.bin',
    0x2000,
    buffer,
);
