const {
    writeStripe,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
} = require('./nametables');

const lookup = flatLookup(`
0123456789SCOREL
VHIGTA-UQPNMKJFB
WXYZ◥,'>!♡abcdef
ghijklmnopqrstuv
wxyz#$%&◤()*+/:;
<=?@[]^_ʡ{|}~¹º»
¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊË
ÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛ
ÜÝÞßàáâãäåæçèéêë
ìíîïðñòóôõö÷øùúû
üýþÿЉЊЋЌЍЎЏАБВГД
ЕЖЗИЙКЛМНОПРСТУФ
ХЦЧШЩЪЫЬЭЮЯабвгд
εζηθικλμνξοπρςστ
υφχψωϊϋόύώϏϐϑϒϓϔ
ϕϖϗϘϙϚϛϜϝϞϟϠϡͰͱ.
`);

const buffer = blankNT();

drawTiles(buffer, lookup, `
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ
ÒÓ............................ÒÓ
ÒÓ...QPPPPPPPPPPPPPPPN........ÒÓ
ÒÓ...M.SCORE..000000.K........ÒÓ
ÒÓ...M.LEVEL...00000.K........ÒÓ
ÒÓ...M.HEIGHT..00000.K........ÒÓ
ÒÓ...M...............K........ÒÓ
ÒÓ...M.-------------.K........ÒÓ
ÒÓ...M.TOTAL..000000.K........ÒÓ
ÒÓ...JFFFFFFFFFFFFFFFB........ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ............................ÒÓ
ÒÓ..............o.............ÒÓ
ÒÓ...........p.rs.u...........ÒÓ
ÒÓ..........◤()*+/:;..........ÒÓ
ÒÓ..........ʡ{|}~¹º»..........ÒÓ
ÒÓ..........ÄÅÆÇÈÉÊË..........ÒÓ
ÒÓ..........ÔÕÖ×ØÙÚÛ..........ÒÓ
ÒÓ..........äåæçèéêë..........ÒÓ
ÒÓ..........ôõö÷øùúû..........ÒÓ
ÒÓâãâãâãâãâãâãâãâãâãâãâãâãâãâãÒÓ
ÒÓòóòóòóòóòóòóòóòóòóòóòóòóòóòóÒÓ
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ
ÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓÒÓ
`);


drawAttrs(buffer, [`
    2222222222222222
    2233333333332222
    2231111111330002
    2231111111330002
    2031111111330002
    2033333333330002
    2000002222220002
    2000002111000002
`,`
    2000002101000002
    2000003333000002
    2000003330000002
    2000003333000002
    2000000000000002
    2000000000000002
    2222222222222222
    0000000000000000
`]);

writeStripe(
    __dirname + '/type_b_ending_nametable.bin',
    0x2000,
    buffer,
);
