const {
    writeStripe,
    blankNT,
    drawTiles,
    drawAttrs,
    flatLookup,
} = require('./nametables');

const lookup = flatLookup(`
0123456789SCOREL
VHIGTA-UQPNMKJFB
WXYZ◥,'>!♡abcdef
ghijklmnopqrstuv
wxyzʞ$%&◤()*+/:;
<=?@[]^_ʡ{|}~¹º»
¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊË
ÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛ
ÜÝÞßàáâãäåæçèéêë
ìíîïðñòóôõö÷øùúû
üýþÿЉЊЋЌЍЎЏАБВГД
ЕЖЗИЙКЛМНОПРСТУФ
ХЦЧШЩЪЫЬЭЮЯабвгд
εζηθικλμνξοπρςστ
υφχψωϊϋόύώϏϐϑϒϓϔ
ϕϖϗϘϙϚϛϜϝϞϟϠϡͰͱ.
`);

const buffer = blankNT();

drawTiles(buffer, lookup, `
................................
................................
................................
.....QPPPPPPPPPPPPPPPN..........
.....M.SCORE..000000.K......УФУФ
.....M.LEVEL...00000.K......ГДГД
.....M.HEIGHT..00000.K......ГДГД
.....M...............K...zʞ$гдГД
УФУФ.M.-------------.K...@[]στГД
ГДГД.M.TOTAL..000000.K.....ÁϓϔГД
ГДГД.JFFFFFFFFFFFFFFFB..УФУФУДГД
ГДГД....................ГДГДГДГД
ГДбв.....Я..............ГДГДГДГД
ГДρς.ïð..ο..............ГДГДГДГД
ГДϑϒ.....Ϗ..................ГДГД
ГДϑϒ.ИЙКϞϟϠ.................ГДГД
ГДГФУФУФУФУФ................гдГД
ГДГДГДГДГДГД................στГД
ГДρв..ХЦЧШ..................ϓϔГД
ГДϑς..εζηθ..................ϓϔГД
ГДϑϒ..υ..ψ..........УФУФУФУФУДГД
ГДϑϒ..ϕ.............ГДГДГДГДГДГД
ГДГФУФУФУФ......./..........гдГД
ГДГДГДГДГД...{|.~¹..........στГД
ГДГДГДГДГД..ÄÅÆÇÈÉÊË.ЛМН..Ý.ϓϔГД
ГДГДГДГДГД..ÔÕÖ×ØÙÚÛ.ЫЬ..ìíîϓϔГД
ГДГДГДГДГД..äåæçèéêë.....üýþϓϔГД
ГДГДГДГДГД..ôõö÷øùúû.ϋόύ.ЕЖЗϓϔГД
òóòóòóòóòóòóòóòóòóòóòóòóòóòóòóòó
ЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌЋЌ
`);


drawAttrs(buffer, [`
    2222222222222222
    2233333333322222
    2231111111322222
    2231111111321122
    2231111111321122
    2233333333322222
    2211220000222222
    2211220000222222
`,`
    2222220000000022
    2220020000000022
    2220020000222222
    2222220000222222
    2222223333330022
    2222220000330022
    2222222222222222
    0000000000000000
`]);

writeStripe(
    __dirname + '/type_b_lvl9_ending_nametable.bin',
    0x2000,
    buffer,
);
